Tekla Open API Reference for Tekla Structures 2025
AnalysisPosition.TypeEnum Enumeration
 The position types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum TypeEnum
Public Enumeration TypeEnum
Members
Member name | Value | Description
TYPE_NORMAL | 0 |  The normal type.
TYPE_SPLIT | 1 |  The split type.
TYPE_USER_SPLIT | 9 |  The user split type.
See Also
Reference
Tekla.Structures.Analysis Namespace